** Cerrando:
#+BEGIN_SRC python :results output
  import requests
  import sys
  next_page = 1
  response = requests.get("http://www.yify.is/api/v2/list_movies.json?query_term=Predestination&page=%s" % next_page)
  print(response.status_code)
  import json
  if response.content:
      dict_response = json.loads(response.content)
      print('Status', dict_response['status'])
      print('Status message', dict_response['status_message'])
      total_results = dict_response['data']['movie_count']
      curr_results = dict_response['data']['movies']
      page = dict_response['data']['page_number']
      limit = dict_response['data']['limit']
      for m in dict_response['data']['movies']:
          if m['title'].find('Predestination') != -1:
              print("Encontre algo")
              print(m)
      while (next_page * limit) < total_results and next_page <= 20:
          for m in dict_response['data']['movies']:
              if m['title'].find('Predestination') != -1:
                  print("Encontre algo")
                  print(m)
                  sys.exit(0)
          next_page = next_page + 1
          response = requests.get("http://www.yify.is/api/v2/list_movies.json?query_term=Predestination&page=%s" % next_page)
          dict_response = json.loads(response.content)
          curr_results = dict_response['data']['movies']
          page = dict_response['data']['page_number']
      else:
          print('Pagina %s, me pudri' % next_page)
#+END_SRC

#+RESULTS:
: 200
: ('Status', u'ok')
: ('Status message', u'Query was successful')
: Encontre algo
: {u'rating': 7.4, u'date_uploaded_unix': 1416866040, u'google_video': u'http://www.yify.is/api/proxylink/2024438', u'torrents': [{u'peers': 157, u'hash': u'A2A76633D94DE3FBE65BE506C45F4A8D9673473C', u'url': u'magnet:?xt=urn:btih:A2A76633D94DE3FBE65BE506C45F4A8D9673473C&amp;dn=Predestination+%282014%29+%5B720p%5D&amp;tr=http%3A%2F%2Ftracker.yify-torrents.com%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Ftracker.publicbt.org%3A80&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Fp4p.arenabg.ch%3A1337&amp;tr=udp%3A%2F%2Fp4p.arenabg.com%3A1337&amp;dt=', u'date_uploaded_unix': u'1432792147', u'seeds': 1234, u'size_bytes': u'794002718', u'quality': u'720p', u'date_uploaded': u'2015-05-28 17:49:07', u'size': u'757.22 MB'}, {u'peers': 97, u'hash': u'02A5AD1A8AF7A8B7BFF49C8FAE39D84A0A25C96A', u'url': u'magnet:?xt=urn:btih:02A5AD1A8AF7A8B7BFF49C8FAE39D84A0A25C96A&amp;dn=Predestination+%282014%29+%5B1080p%5D&amp;tr=http%3A%2F%2Ftracker.yify-torrents.com%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Ftracker.publicbt.org%3A80&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Fp4p.arenabg.ch%3A1337&amp;tr=udp%3A%2F%2Fp4p.arenabg.com%3A1337&amp;dt=', u'date_uploaded_unix': u'1432792147', u'seeds': 669, u'size_bytes': u'1546188226', u'quality': u'1080p', u'date_uploaded': u'2015-05-28 17:49:07', u'size': u'1.44 GB'}], u'year': 2014, u'id': u'60616', u'genres': [u'Drama', u' Mystery', u' Sci-Fi', u' Thriller'], u'title': u'Predestination', u'title_long': u'Predestination (2014)', u'state': u'ok', u'small_cover_image': u'http://video2k.is/data/my_videos/cover/cover-36032429-vidipu-movie.jpg', u'mpa_rating': u'R', u'background_image': u'http://www.yify.is/data/background/60616.jpg', u'imdb_code': u'tt2397535', u'medium_cover_image': u'http://www.yify.is/data/medium_cover/60616.jpg', u'slug': u'predestination-2014', u'directors': [u'Michael Spierig', u' Peter Spierig'], u'language': u'English', u'url': u'http://www.yify.is/movie/yifi_view/predestination-2014/60616', u'cast': [u'Ethan Hawke', u' Sarah Snook', u' Christopher Kirby', u' Christopher Som'], u'synopsis': u"The film begins with a temporal agent attempting to apprehend an infamous terrorist known as the 'Fizzle Bomber'...", u'date_uploaded': u'2014-11-24 21:54:00', u'runtime': 97, u'yt_trailer_code': u'-FcK_UiVV40'}
: Pagina 1, me pudri
